// 배열
let numArr: number[] = [1, 2, 3];
let strArr: string[] = ["hello", "im", "typeScript"];
let bool1Arr: boolean[] = [true, true];

// 배열_제네릭 문법
let boolArr: Array<boolean> = [true, false, true];

/**
 * 📝 배열의 타입을 잘 모를경우, 변수에 커서를 올리면
 *    점진적 타입 시스템을 사용하기 때문에 변수의 타입을 초기화 하는 값기준으로 추론함
 * */

// 배열에 들어가는 요소들의 타입이 다양한 경우
let multiArr = [1, "hello"]; // 커서를 올려보아요
let multi1Arr: (number | string)[] = [1, "hello"];

// 다차원 배열의 타입을 정의하는 방법 (2,3차원 배열)
let doubleArr = [
  [1, 2, 3],
  [4, 5],
];
let doubleArr1: number[][] = [
  [1, 2, 3],
  [4, 5],
];

let tripleArr: number[][][] = [
  [
    [1, 2, 3],
    [4, 5, 5],
  ],
  [
    [4, 5, 5],
    [1, 2, 3],
  ],
];

// ⭐ 튜플 : 길이와 타입이 고정된 배열
let tup1: [number, number] = [1, 2];
// tup1 = [1,2,3] (❌ 길이안맞음)
// tup1 = ['1','2'] (❌ 타입 안맞음)

let tup2: [number, string, boolean] = [1, "2", true];
// tupe2 = [true, 1, "2"] (❌ 순서 안맞음)

/**
 * 📝 튜플타입은 JS에서 배열로 인식하기 때문에,
 * push 나 pop 함수로 요소를 추가하거나 제거하는 기능을 사용할때는
 * 컴파일에서 에러가 안나기때문에 주의 필요
 * -> tup1 의 값에 tup1.push("글자"); 에러안나서 주의 필요
 */

/**
 * 📝 튜플은 이럴때 사용해
 * 다차원 배열에서 인덱스에 맞는 값을 넣는것이 헷갈릴때
 */
const user1 = [
  ["사람1", 1],
  ["사람2", 2],
  ["사람3", 3],
  [4, "사람4"], // 요게 문제!
];

const user: [string, number][] = [
  ["사람1", 1],
  ["사람2", 2],
  ["사람3", 3],
  ["사람4", 4],
  // [4, "사람4"], (❌ 에디터 오류 표시)
];
