/**
 * 타입 단언
 */

type Person = {
  name: string;
  age: number;
};

// 나중에 프로퍼티의 값을 초기화 시켜주고싶을 때
let person = {} as Person;
person.name = "이정환";
person.age = 27;

type Dog = {
  name: string;
  color: string;
};

let dog1: Dog = {
  name: "수수",
  color: "brown",
  // breed: "진도", ❌ 초과 프로퍼티 검사로인해 오류
};

let dog = {
  name: "수수",
  color: "brown",
  bread: "진도",
} as Dog;

/**
 * 📝 타입단언을 사용하기 위해서 지켜야하는 규칙
 * 값 as 단언 <- 단언식
 * A as B
 * ⭐ A가 B의 슈퍼타입이거나
 * ⭐ A가 B의 서브타입이여야 한다.
 */

let num1 = 10 as never; // never타입으로 추론
// never은 모든 타입의 서브타입이기때문에 가능
// A가 B의 슈퍼타입

let num2 = 10 as unknown;
// unknown은 모든 타입의 슈퍼타입이기때문에 가능
// A가 B의 서브 타입

// let num3 = 10 as string;
//❌ number 형식을 string 형식으로 변환한 작업은 실 수 일 수 있습니다.
// 두형식이 서로 충분히 겹치지 않기 때문입니다. 읟적으로 변환한 경우에는 먼저 unknown으로 식을 변환합니다.
// A(number Type) , B(string Type) A,B타입은 서로소집합

/**
 * 다중 단언
 */
// 어떻게든 단언을 성공시키는 방법
let num0 = 10 as unknown as string;
// A가 B의 서브타입 (A: number, B: unknown)
// A가 B의 슈퍼타입 (A: unknown, B: string)

// 정말 어쩔수 없는 상황에서만 사용해야 함

/**
 * const 단언
 * 변수를 선언했을 때 const와 선언했을때랑 동일한 효과를 보도록 만들어주는 단언
 */

let num4 = 10 as const; // 넘버 리터럴 타입으로 추론됨 num4:10

// 객체 타입과 사용할때 활용도가 있음
// 모든 값이 readonly 프로퍼티로 추론됨
let cat = {
  name: "야옹이",
  color: "yellow",
} as const;

/**
 * 📝 프로퍼티가 굉장히 많은 객체중 값들이 전부 readonly라면
 * 일일이 readonly를 붙혀줄 필요없이 const로 단언하면 된다.
 */

/**
 * 옵셔널 체이닝
 */

type Post = {
  title: string;
  author?: string;
};

let post: Post = {
  title: "게시글1",
  author: "이정환",
};

// const len: number = post.author❔.length;  (❌ 'number' | 'undefined' 형식은 'number' 형식에 할당할 수 없습니다.)
// post.author뒤  ? 는 옵셔널 체이닝으로 자동으로 붙게됨
// author이 null이거나 undefined인 경우에 값 전체가 undefined가 되게 만들어주는 연산자

/**
 * Non Null 단언
 * ! 를 써줘서 값이 null 또는 undefined가 아님을 알려주는 단언
 */
const len: number = post.author!.length;

/**
 * 📝 타입단언은 값을 타입으로 바꾸는 것이 아니다 ≒ 업캐스팅,다운캐스팅과 다르다.
 *  타입스크립트 컴파일러에 눈을 잠깐 가리는 정도로 해석
 *  그래서 약간 위험하기때문에 확실할 때만 사용해야함
 */
