/**
 * 기본 타입간의 호환성
 */

let num1: number = 10;
let num2: 10 = 10;
// 업캐스팅 호환성
num1 = num2;

/**
 * 객체 타입간의 호환성
 * -> 어떤 객체타입을 다른 객체타입으로 취급해도 괜찮은가?
 */

type Animal = {
  name: string;
  color: string;
};

type Dog = {
  name: string;
  color: string;
  breed: string;
};

let animal: Animal = {
  name: "기린",
  color: "yellow",
};

let dog: Dog = {
  name: "수수",
  color: "yellow",
  breed: "진도믹스",
};

animal = dog; // Animal 타입은 Dog타입의 슈퍼타입으로 업캐스팅되고 있음

// dog = animal; (❌ bread 속성이 Animal 형식에 없지만 Dog 형식에서 필수입니다.)
// Dog타입은 Animal타입의 서브타입으로 다운캐스팅 되고 있음

/**
 * 📝객체들도 기본 타입들처럼 서로 슈퍼·서브 관계를 갖는데
 * 프로퍼티 기준으로 가진다
 */

// PRACTICE

type Book = {
  name: string;
  price: number;
};

type ProgramingBook = {
  name: string;
  price: number;
  skill: string;
};

let book: Book;
let programingBook: ProgramingBook = {
  name: "한 입 크기로 잘라먹는 리엑트",
  price: 33000,
  skill: "reactjs",
};

// book타입이 슈퍼타입 programingBook이 서브타입
book = programingBook; // 업캐스팅
// programingBook = book; (❌ 'skill' 속성이 Book 형식에 없지만 ProgremingBook 형식에서 필수입니다._다운캐스팅)

let book2: Book = {
  name: "한 입 크기로 잘라먹는 리엑트",
  price: 33000,
  // skill: "reactjs", (❌ 개체 리터럴은 알려진 속성만 지정할 수 있으며 'Book'형식에 'skil'이 없습니다.)
};
/**
 * 📝 초과 프러퍼티 검사
 * Book 타입에 skill프로퍼티 넣으면 업캐스팅 느낌인거같은데 절대 아님
 * 초과 프로퍼티 검사라는 타입 스크립트의 특수한 기능이 발동되기때문에 저렇게 못씀
 * 초기화 하는 값으로 객체 리터럴을 사용하면 발동하는 검사로
 * 저런식으로 객체 리터럴을 초기값으로 사용하면 정의해놓지 않은 프로퍼티를 작성하면 안되도록 막는 검사임!
 */

// 초과 프로퍼티 검사를 피하려면?
let book3: Book = programingBook;
// 초기화할때 객체 리터럴을 사용한것이 아니기때문에 초과 프러퍼티 검사가 발동하지않아 허용

// 함수에서도 마찬가지로 발동됨

function func(book: Book) {}

/*
func({
  name: "객체 리터럴을 쓰면 초과프러퍼티 검사 실행돼요.",
  price: 500,
  skill: "reactjs", => 안됨! 
});
*/
func(programingBook); // 가능
