/**
 * ⭐ 선언 합침
 * : 인터페이스에서는 동일한 이름으로 정의한 인터페이스를 전부 합친다.
 */

type Person_ = {
  name: string;
};

/*
type Person_ = {
  name: string;
}; ❌ Person_ 식별자가 중복되었습니다. */

/**
 * 📝 타입별칭에서 동일한 타입을 두번 정의하려고하면 오류 발생
 * 하지만 인터페이스에서는 동일한 이름으로 정의한 인터페이스를 다 합침
 */

interface Person {
  name: string;
}

interface Person {
  age: number;
}

const person: Person = {
  name: "이름",
  age: 2,
};

/**
 * 📝 동일한 프로퍼티를 중복 정의하는데 타입을 다르게 정의하는 경우에는
 *     충돌이라고 하며, 이런 충돌은 허용되지 않음
 *     동일한 프로퍼티 정의를 하려면 타입도 똑같이 정의해야함
 *     확장과 다르게 서브타입도 안되고, 꼭 동일한 타입만 가능함.
 */

// interface Person {
//   name: number ❌ name: string과 충돌
// }

// interface Person {
//    name: "서브타입도 안돼요."; ❌ 서브타입 안됨
// }

/**
 * 📝 인터페이스 합침을 사용하는 경우에는
 * 라이브러리의 인터페이스 정의가 부실한 경우, 보강하는 작업할때 씀
 */

// 라이브러리 기본 인터페이스
interface Lib {
  a: number;
  b: number;
}

// 모듈보강 _ c프로퍼티 하나 추가해야할경우 이럴때 사용
interface Lib {
  c: number;
}

const lib: Lib = {
  a: 1,
  b: 2,
  c: 3,
};
