/**
 * 함수 타입 정의
 */

// 함수를 설명하는 가장 좋은 방법
// 어떤 [타입]의 매개변수를 받고, 어떤 [타입]의 결과값을 반환하는지 설명
function func(a: number, b: number): number {
  return a + b;
}

/**
 * 화살표 함수의 타입을 정의하는 방법
 */

const add = (a: number, b: number): number => {
  return a + b;
};

/**
 * 함수의 매개변수
 */

// 기본값의 기준으로 타입 자동 추론
function introduce(name = "이정환") {
  console.log(`name: ${name}`);
}

/**
 * 📝 주의사항
 * 매개변수의 타입을 기본값의 타입과 다르게 정의하면 오류
 * 자동추론된 매개변수 타입에 다른 타입의 값을 인수로 전달하면 오류
 */

// tall은 nuber | undefined 으로 자동추론
// 따라서, 타입가드로 타입좁혀서 사용해야함
function introduce_(name = "이정환", tall?: number) {
  console.log(`name: ${name}`);
  if (typeof tall === "number") {
    console.log(`tall: ${tall}`);
  }
}

introduce_("이정환", 175);
introduce_("이정환");

/**
 * 📝 주의사항
 * 선택적 매개변수는 필수 매개변수 앞에 위치하면 안됨
 * function introduce(name = "이정환", tall?:number , age:number )
 * └── ❌ age(필수 매개변수)가 tall(선택적 매개변수) 앞에 위치해야함
 */

/**
 * ⭐ rest param (JS 문법)
 * ...rest
 * : 가변적인 길이의 인수들을 전달을 하면 배열로 묶어 rest에 저장하도록 돕는 문법
 */

// 모든값을 더한 값이 반환값이 되는 함수라고 가정
function getSum(...rest: number[]) {
  let sum = 0;
  rest.forEach((it) => sum + it);
  return sum;
}

getSum(1, 2, 3); //6
getSum(1, 2, 3, 4, 5); // 15

// rest param을 써도 매개변수를 고정하고싶다면
// 튜플 타입으로 만들어주면 된다.

function getSum_(...rest: [number, number, number]) {
  let sum = 0;
  rest.forEach((it) => sum + it);
  return sum;
}

getSum_(1, 2, 3);
// getSum_(1,2); ❌ 3개의 인수가 필요한데 2개를 가져왔습니다
