/**
 * 함수 타입 호환성
 * : 특정 함수 타입을 다른 함수 타입으로 취급해도 괜찮은가를 판단하는 것
 * 기준 1. 반환값의 타입이 호환되는가
 * 기준 2. 매개변수의 타입이 호환되는가
 *    => 이 두가지 기준을 만족해야지 타입이 호환된다고 판단
 */

/* 기준 1. 반환값의 타입이 호환되는가
           └── 반환값이 다운캐스팅이 되면 안됨 */
type A = () => number;
type B = () => 10;

let a: A = () => 10;
let b: B = () => 10;

a = b; // 업캐스팅이기 때문에 허용

// b = a; ❌ 'A'형식은 'B'형식에 할당할 수 없습니다
//        └── 'number'형식은 '10'형식에 할당할 수 없습니다. (다운캐스팅)

/*  기준 2. 매개변수가 호환되는가
    └──2-1. 매개변수의 개수가 같을 때 */
type C = (value: number) => void;
type D = (value: number) => void;

let c: C = (value) => {};
let d: D = (value) => {};

c = d;
d = c;

type C_ = (value: number) => void;
type D_ = (value: 10) => void;

let c_: C_ = (value) => {};
let d_: D_ = (value) => {};

d_ = c_; // 다운캐스팅
// c_ = d_;  ❌ 'D_형식은 C_형식에 할당할 수 없습니다.
//                └──value 및 value 매개 변수의 형식이 호환되지 않습니다.
//                └── number형식은 10 형식에 할당할 수 없습니다. (업캐스팅)
/**
 * 📝 매개변수의 호환성을 판단할 때는 반대로 업캐스팅이 호환되지 않음
 *     밑은 예시 코드
 */

type Animal = {
  name: string;
};
// Animal이 Dog의 슈퍼타입

type Dog = {
  name: string;
  color: string;
};

let animalFunc = (animal: Animal) => {
  console.log(animal.name);
};

let dogFunc = (dog: Dog) => {
  console.log(dog.name);
  console.log(dog.color);
};

// animalFunc = dogFunc; ❌(dog:Dog) => void 형식은 (animal:Animal) => void 형식에 할당할 수 없습니다.
//                          └──dog 및 animal 매개 변수의 형식이 호환되지 않습니다.
//                          └── color 속성이 Animal 형식엔 없지만 Dog 형식에서 필수입니다. (매개변수 업캐스팅)

dogFunc = animalFunc; // 매개변수 다운캐스팅

/*  기준 2. 매개변수가 호환되는가
    └──2-2. 매개변수의 개수가 다를 때
    : 할당하려는 쪽의 함수 타입에 매개변수의 갯수가 더 작을때만 호환됨
      단, 매개변수 타입이 같아야함*/

type Func1 = (a: number, b: number) => void;
type Func2 = (a: number) => void;

let func1: Func1 = (a, b) => {};
let func2: Func2 = (a) => {};

func1 = func2;
// func2 = func1;  ❌ Func1 형식은 Func2 형식에 할당할 수 없습니다.
//                 └── 대상 서명이 너무 적은 인수를 제공합니다.
